#include "Framework.h"

void Framework::Initialize()
{
	//-------------------------------------
	// リークチェッカー
	//-------------------------------------

	pLeakChecke_->~D3DResourceLeakChecker();

	//-------------------------------------
	// SRVマネージャの初期化
	//-------------------------------------

	SrvManager::GetInstance()->Initialize(DirectXCommon::GetInstance());

	//-------------------------------------
	// キーボード入力の初期化
	//-------------------------------------

	pInput_ = new Input();
	pInput_->Initialize(WinApp::GetInstance());

	//-------------------------------------
	// Audioの初期化
	//-------------------------------------

	pAudio_ = new Audio();
	pAudio_->InitXAudio2();

	//-------------------------------------
	// ImGui（デバッグテキスト）の初期化
	//-------------------------------------

	pImguiManager_ = new ImGuiManager();
	pImguiManager_->Initialize(DirectXCommon::GetInstance(), WinApp::GetInstance());

	//-------------------------------------
	// テクスチャマネージャの初期化
	//-------------------------------------

	TextureManager::GetInstance()->Initialize(DirectXCommon::GetInstance());

	//-------------------------------------
	// 3dモデルマネージャの初期化
	//-------------------------------------

	ModelManager::GetInstance()->Initialize(DirectXCommon::GetInstance());

	//-------------------------------------
	// スプライト共通部の初期化
	//-------------------------------------

	pSpCpmmon_ = new SpriteCommon();
	pSpCpmmon_->Initialize(DirectXCommon::GetInstance());
}

void Framework::Finalize()
{
	//-------------------------------------
	// ImGuiの終了処理
	//-------------------------------------

	pImguiManager_->Finalize();

	//-------------------------------------
	// SRVマネージャの終了処理
	//-------------------------------------

	SrvManager::GetInstance()->Finalize();

	//-------------------------------------
	// Audioクラスの後始末
	//-------------------------------------

	pAudio_->ResetXAudio2();

	//-------------------------------------
	// 3dモデルマネージャの終了処理
	//-------------------------------------

	ModelManager::GetInstance()->Finalize();

	//-------------------------------------
	// テクスチャマネージャの終了処理
	//-------------------------------------

	TextureManager::GetInstance()->Finalize();

	//-------------------------------------
	// 解放処理
	//-------------------------------------

	delete pImguiManager_;
	delete pAudio_;
	delete pInput_;
}

void Framework::Update()
{
	//-------------------------------------
	// フレームの始まる旨を告げる
	//-------------------------------------

	pImguiManager_->Begin();

	//-------------------------------------
	// キーボード入力の更新
	//-------------------------------------

	pInput_->Update();

	//-------------------------------------
	// ImGui（デバッグテキスト）の更新
	//-------------------------------------

	pImguiManager_->UpdateGameUI();

}

void Framework::Run()
{

	//-------------------------------------
	// ゲームの初期化
	//-------------------------------------

	Initialize();

	//-------------------------------------
	// ゲームループ
	//-------------------------------------

	while (true)
	{
		//-------------------------------------
		// 毎フレーム更新処理
		//-------------------------------------

		Update();

		//-------------------------------------
		// 終了リクエストが来たら抜ける
		//-------------------------------------

		if (IsEndRequest()) {
			break;
		}

		//-------------------------------------
		// 描画
		//-------------------------------------

		Draw();

		//-------------------------------------
		//ゲームの処理が終わり描画処理に入る前に、ImGuiの内部コマンドを生成する
		//-------------------------------------

		pImguiManager_->End();

		//-------------------------------------
		// 画面表示できるようにする
		//-------------------------------------

		pImguiManager_->Draw();

	}

	//-------------------------------------
	// ゲームの終了
	//-------------------------------------

	Finalize();

}
