#include "GameSystem.h"

void GameSystem::Initialize()
{
#pragma region 基盤システムの初期化

	//-------------------------------------
	// WinAppAPIの初期化
	//-------------------------------------

	pWinApp_ = WinApp::GetInstance();
	pWinApp_->Initialize();

	//-------------------------------------
	// DirectXの初期化
	//-------------------------------------

	pDxCommon_ = DirectXCommon::GetInstance();
	pDxCommon_->Initialize(pWinApp_);
	
	//-------------------------------------
	// 基底クラスの初期化
	//-------------------------------------

	Framework::Initialize();

	//-------------------------------------
	// スプライト共通部の初期化
	//-------------------------------------

	pSpriteCommon_ = SpriteCommon::GetInstance();
	pSpriteCommon_->Initialize(pDxCommon_);

	//-------------------------------------
	// 3dオブジェクト共通部の初期化
	//-------------------------------------

	pObject3dCommon_ = Object3dCommon::GetInstance();
	pObject3dCommon_->Initialize(pDxCommon_);

	
#pragma endregion 基盤システムの初期化

#pragma region シーン

	//-------------------------------------
	// ゲームシーンの初期化
	//-------------------------------------

	pGameScene_ = new GameScene();
	pGameScene_->Initialize();

#pragma endregion シーン

}

void GameSystem::Finalize()
{
	//-------------------------------------
	// COMの終了処理
	//-------------------------------------

	CoUninitialize();

	//-------------------------------------
	// 3dオブジェクト共通部の終了処理
	//-------------------------------------

	pObject3dCommon_->Finalize();

	//-------------------------------------
	// スプライト共通部の終了処理
	//-------------------------------------

	pSpriteCommon_->Finalize();

	//-------------------------------------
	// WindowsAPIの終了処理
	//-------------------------------------

	pWinApp_->Finalize();

	//-------------------------------------
	// DirectXCommonの終了処理
	//-------------------------------------

	pDxCommon_->Finalize();

	//-------------------------------------
	// ゲームシーンの終了処理
	//-------------------------------------

	pGameScene_->Finalize();

	//-------------------------------------
	// 基底クラスの終了処理
	//-------------------------------------

	Framework::Finalize();

}

void GameSystem::Update()
{	
	//-------------------------------------
	// 基底クラスの更新処理
	//-------------------------------------

	Framework::Update();

	//-------------------------------------
	// ゲームシーンの更新処理
	//-------------------------------------

	pGameScene_->Update();

	//-------------------------------------
	// 終了リクエストを確認
	//-------------------------------------

	if (pWinApp_->ProcessMessage()) {
		endRequest_ = true;
	}

	//-------------------------------------
	// ImGui（デバッグテキスト）の更新
	//-------------------------------------

	pSpriteCommon_->ImGui();

}

void GameSystem::PreDraw()
{	
	//-------------------------------------
	// 描画前処理
	//-------------------------------------

	// DirectXの描画準備。すべての描画に共通のグラフィックスコマンドを積む
	pDxCommon_->PreDraw();

	// DescriptorHeapを設定
	SrvManager::GetInstance()->PreDraw();
	
	//-------------------------------------
	// スプライト描画準備
	//-------------------------------------

	// Spriteの描画準備。Spriteの描画に共通のグラフィックスコマンドを積む
	pSpriteCommon_->SetDraw();
	
	//-------------------------------------
	// 3dオブジェクト描画準備
	//-------------------------------------

	// 3dオブジェクトの描画準備。3dオブジェクトの描画に共通のグラフィックスコマンドを積む
	pObject3dCommon_->SetDraw();

}

void GameSystem::Draw()
{
	//-------------------------------------
	// ゲームシーンの描画処理
	//-------------------------------------

	pGameScene_->Draw();

}

void GameSystem::PostDraw()
{
	//-------------------------------------
	// 基底クラスの描画後処理
	//-------------------------------------

	Framework::PostDraw();

	//-------------------------------------
	// 描画後処理
	//-------------------------------------

	pDxCommon_->PostDraw();
}
