#include "MyGame.h"

void MyGame::Initialize()
{
#pragma region 基盤システムの初期化
	
	//-------------------------------------
	// 基底クラスの初期化
	//-------------------------------------

	OYFramework::Initialize();

	//-------------------------------------
	// スプライト共通部の初期化
	//-------------------------------------

	pSpriteCommon_ = SpriteCommon::GetInstance();
	pSpriteCommon_->Initialize(DirectXCommon::GetInstance());

	//-------------------------------------
	// 3dオブジェクト共通部の初期化
	//-------------------------------------

	pObject3dCommon_ = Object3dCommon::GetInstance();
	pObject3dCommon_->Initialize(DirectXCommon::GetInstance());

	
#pragma endregion 基盤システムの初期化

#pragma region シーン

	//-------------------------------------
	// タイトルシーンの初期化
	//-------------------------------------

	pTitleScene_ = new TitleScene();
	pTitleScene_->Initialize();

	//-------------------------------------
	// ゲームシーンの初期化
	//-------------------------------------

	/*pGameScene_ = new GameScene();
	pGameScene_->Initialize();*/

#pragma endregion シーン

}

void MyGame::Finalize()
{
	//-------------------------------------
	// COMの終了処理
	//-------------------------------------

	CoUninitialize();

	//-------------------------------------
	// 3dオブジェクト共通部の終了処理
	//-------------------------------------

	pObject3dCommon_->Finalize();

	//-------------------------------------
	// スプライト共通部の終了処理
	//-------------------------------------

	pSpriteCommon_->Finalize();

	//-------------------------------------
	// ゲームシーンの終了処理
	//-------------------------------------
	
	pTitleScene_->Finalize();

	//-------------------------------------
	// ゲームシーンの終了処理
	//-------------------------------------

	//pGameScene_->Finalize();

	//-------------------------------------
	// 基底クラスの終了処理
	//-------------------------------------

	OYFramework::Finalize();

	//-------------------------------------
	// ポインタ解放
	//-------------------------------------

	delete pGameScene_;
	delete pTitleScene_;

}

void MyGame::Update()
{	
	//-------------------------------------
	// 基底クラスの更新処理
	//-------------------------------------

	OYFramework::Update();

	//-------------------------------------
	// タイトルシーンの更新処理
	//-------------------------------------

	pTitleScene_->Update();

	//-------------------------------------
	// ゲームシーンの更新処理
	//-------------------------------------

	//pGameScene_->Update();

	//-------------------------------------
	// ImGui（デバッグテキスト）の更新
	//-------------------------------------

	pSpriteCommon_->ImGui();

}

void MyGame::PreDraw()
{	
	
	//-------------------------------------
	// 基底クラスの描画前処理
	//-------------------------------------

	OYFramework::PreDraw();


	//-------------------------------------
	// スプライト描画準備
	//-------------------------------------

	// Spriteの描画準備。Spriteの描画に共通のグラフィックスコマンドを積む
	pSpriteCommon_->SetDraw();
	
	//-------------------------------------
	// 3dオブジェクト描画準備
	//-------------------------------------

	// 3dオブジェクトの描画準備。3dオブジェクトの描画に共通のグラフィックスコマンドを積む
	pObject3dCommon_->SetDraw();

}

void MyGame::Draw()
{
	//-------------------------------------
	// タイトルシーンの描画処理
	//-------------------------------------

	pTitleScene_->Draw();

	//-------------------------------------
	// ゲームシーンの描画処理
	//-------------------------------------

	//pGameScene_->Draw();

}

void MyGame::PostDraw()
{
	//-------------------------------------
	// 基底クラスの描画後処理
	//-------------------------------------

	OYFramework::PostDraw();

}
