#include "OYFramework.h"

void OYFramework::Initialize()
{
	//-------------------------------------
	// リークチェッカー
	//-------------------------------------

	pLeakChecke_->~D3DResourceLeakChecker();

	//-------------------------------------
	// WinAppAPIの初期化
	//-------------------------------------

	pWinApp_ = WinApp::GetInstance();
	pWinApp_->Initialize();

	//-------------------------------------
	// DirectXの初期化
	//-------------------------------------

	pDxCommon_ = DirectXCommon::GetInstance();
	pDxCommon_->Initialize(pWinApp_);

	//-------------------------------------
	// SRVマネージャの初期化
	//-------------------------------------

	SrvManager::GetInstance()->Initialize(pDxCommon_);

	//-------------------------------------
	// キーボード入力の初期化
	//-------------------------------------

	pInput_ = new Input();
	pInput_->Initialize(WinApp::GetInstance());

	//-------------------------------------
	// Audioの初期化
	//-------------------------------------

	pAudio_ = new Audio();
	pAudio_->InitXAudio2();

	//-------------------------------------
	// ImGui（デバッグテキスト）の初期化
	//-------------------------------------

	pImguiManager_ = new ImGuiManager();
	pImguiManager_->Initialize(pDxCommon_, pWinApp_);

	//-------------------------------------
	// シーンマネージャの生成
	//-------------------------------------

	pSceneManager_ = new SceneManager();

	//-------------------------------------
	// テクスチャマネージャの初期化
	//-------------------------------------

	TextureManager::GetInstance()->Initialize(pDxCommon_);

	//-------------------------------------
	// 3dモデルマネージャの初期化
	//-------------------------------------

	ModelManager::GetInstance()->Initialize(pDxCommon_);

}

void OYFramework::Finalize()
{
	//-------------------------------------
	// シーンマネージャの解放
	//-------------------------------------

	delete pSceneManager_;

	//-------------------------------------
	// ImGuiの終了処理
	//-------------------------------------

	pImguiManager_->Finalize();

	//-------------------------------------
	// Audioクラスの後始末
	//-------------------------------------

	pAudio_->ResetXAudio2();

	//-------------------------------------
	// 3dモデルマネージャの終了処理
	//-------------------------------------

	ModelManager::GetInstance()->Finalize();

	//-------------------------------------
	// テクスチャマネージャの終了処理
	//-------------------------------------

	TextureManager::GetInstance()->Finalize();

	//-------------------------------------
	// SRVマネージャの終了処理
	//-------------------------------------

	SrvManager::GetInstance()->Finalize();

	//-------------------------------------
	// DirectXCommonの終了処理
	//-------------------------------------

	pDxCommon_->Finalize();
	
	//-------------------------------------
	// WindowsAPIの終了処理
	//-------------------------------------

	pWinApp_->Finalize();

	//-------------------------------------
	// 解放処理
	//-------------------------------------

	delete pImguiManager_;
	delete pAudio_;
	delete pInput_;
}

void OYFramework::Update()
{	
	//-------------------------------------
	// 終了リクエストを確認
	//-------------------------------------

	if (pWinApp_->ProcessMessage()) {
		endRequest_ = true;
	}

	//-------------------------------------
	// フレームの始まる旨を告げる
	//-------------------------------------

	pImguiManager_->Begin();

	//-------------------------------------
	// キーボード入力の更新
	//-------------------------------------

	pInput_->Update();

	//-------------------------------------
	// ImGui（デバッグテキスト）の更新
	//-------------------------------------

	pImguiManager_->UpdateGameUI();

	//-------------------------------------
	// シーンマネージャの更新
	//-------------------------------------

	pSceneManager_->Update();

}

void OYFramework::PreDraw()
{
	//-------------------------------------
	// 描画前処理
	//-------------------------------------

	// DirectXの描画準備。すべての描画に共通のグラフィックスコマンドを積む
	pDxCommon_->PreDraw();

	// DescriptorHeapを設定
	SrvManager::GetInstance()->PreDraw();

}

void OYFramework::PostDraw()
{
	//-------------------------------------
	// ゲームの処理が終わり描画処理に入る前に、ImGuiの内部コマンドを生成する
	//-------------------------------------

	pImguiManager_->End();

	//-------------------------------------
	// 画面表示できるようにする
	//-------------------------------------

	pImguiManager_->Draw();

	//-------------------------------------
	// 描画後処理
	//-------------------------------------

	pDxCommon_->PostDraw();

}

void OYFramework::Run()
{

	//-------------------------------------
	// ゲームの初期化
	//-------------------------------------

	Initialize();

	//-------------------------------------
	// ゲームループ
	//-------------------------------------

	while (true)
	{
		//-------------------------------------
		// 毎フレーム更新処理
		//-------------------------------------

		Update();

		//-------------------------------------
		// 終了リクエストが来たら抜ける
		//-------------------------------------

		if (IsEndRequest()) {
			break;
		}

		//-------------------------------------
		// 描画前処理
		//-------------------------------------

		PreDraw();

		//-------------------------------------
		// 描画
		//-------------------------------------

		Draw();

		//-------------------------------------
		// 描画後処理
		//-------------------------------------

		PostDraw();

	}

	//-------------------------------------
	// ゲームの終了
	//-------------------------------------

	Finalize();

}
